Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mcan.h
#define MCAN_NDAT1_ND0_Pos                  0                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND0_Msk                  (_U_(0x1) << MCAN_NDAT1_ND0_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND0                      MCAN_NDAT1_ND0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND0_Msk instead */
#define MCAN_NDAT1_ND1_Pos                  1                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND1_Msk                  (_U_(0x1) << MCAN_NDAT1_ND1_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND1                      MCAN_NDAT1_ND1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND1_Msk instead */
#define MCAN_NDAT1_ND2_Pos                  2                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND2_Msk                  (_U_(0x1) << MCAN_NDAT1_ND2_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND2                      MCAN_NDAT1_ND2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND2_Msk instead */
#define MCAN_NDAT1_ND3_Pos                  3                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND3_Msk                  (_U_(0x1) << MCAN_NDAT1_ND3_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND3                      MCAN_NDAT1_ND3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND3_Msk instead */
#define MCAN_NDAT1_ND4_Pos                  4                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND4_Msk                  (_U_(0x1) << MCAN_NDAT1_ND4_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND4                      MCAN_NDAT1_ND4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND4_Msk instead */
#define MCAN_NDAT1_ND5_Pos                  5                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND5_Msk                  (_U_(0x1) << MCAN_NDAT1_ND5_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND5                      MCAN_NDAT1_ND5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND5_Msk instead */
#define MCAN_NDAT1_ND6_Pos                  6                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND6_Msk                  (_U_(0x1) << MCAN_NDAT1_ND6_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND6                      MCAN_NDAT1_ND6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND6_Msk instead */
#define MCAN_NDAT1_ND7_Pos                  7                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND7_Msk                  (_U_(0x1) << MCAN_NDAT1_ND7_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND7                      MCAN_NDAT1_ND7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND7_Msk instead */
#define MCAN_NDAT1_ND8_Pos                  8                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND8_Msk                  (_U_(0x1) << MCAN_NDAT1_ND8_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND8                      MCAN_NDAT1_ND8_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND8_Msk instead */
#define MCAN_NDAT1_ND9_Pos                  9                                              /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND9_Msk                  (_U_(0x1) << MCAN_NDAT1_ND9_Pos)               /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND9                      MCAN_NDAT1_ND9_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND9_Msk instead */
#define MCAN_NDAT1_ND10_Pos                 10                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND10_Msk                 (_U_(0x1) << MCAN_NDAT1_ND10_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND10                     MCAN_NDAT1_ND10_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND10_Msk instead */
#define MCAN_NDAT1_ND11_Pos                 11                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND11_Msk                 (_U_(0x1) << MCAN_NDAT1_ND11_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND11                     MCAN_NDAT1_ND11_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND11_Msk instead */
#define MCAN_NDAT1_ND12_Pos                 12                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND12_Msk                 (_U_(0x1) << MCAN_NDAT1_ND12_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND12                     MCAN_NDAT1_ND12_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND12_Msk instead */
#define MCAN_NDAT1_ND13_Pos                 13                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND13_Msk                 (_U_(0x1) << MCAN_NDAT1_ND13_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND13                     MCAN_NDAT1_ND13_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND13_Msk instead */
#define MCAN_NDAT1_ND14_Pos                 14                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND14_Msk                 (_U_(0x1) << MCAN_NDAT1_ND14_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND14                     MCAN_NDAT1_ND14_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND14_Msk instead */
#define MCAN_NDAT1_ND15_Pos                 15                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND15_Msk                 (_U_(0x1) << MCAN_NDAT1_ND15_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND15                     MCAN_NDAT1_ND15_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND15_Msk instead */
#define MCAN_NDAT1_ND16_Pos                 16                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND16_Msk                 (_U_(0x1) << MCAN_NDAT1_ND16_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND16                     MCAN_NDAT1_ND16_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND16_Msk instead */
#define MCAN_NDAT1_ND17_Pos                 17                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND17_Msk                 (_U_(0x1) << MCAN_NDAT1_ND17_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND17                     MCAN_NDAT1_ND17_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND17_Msk instead */
#define MCAN_NDAT1_ND18_Pos                 18                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND18_Msk                 (_U_(0x1) << MCAN_NDAT1_ND18_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND18                     MCAN_NDAT1_ND18_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND18_Msk instead */
#define MCAN_NDAT1_ND19_Pos                 19                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND19_Msk                 (_U_(0x1) << MCAN_NDAT1_ND19_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND19                     MCAN_NDAT1_ND19_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND19_Msk instead */
#define MCAN_NDAT1_ND20_Pos                 20                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND20_Msk                 (_U_(0x1) << MCAN_NDAT1_ND20_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND20                     MCAN_NDAT1_ND20_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND20_Msk instead */
#define MCAN_NDAT1_ND21_Pos                 21                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND21_Msk                 (_U_(0x1) << MCAN_NDAT1_ND21_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND21                     MCAN_NDAT1_ND21_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND21_Msk instead */
#define MCAN_NDAT1_ND22_Pos                 22                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND22_Msk                 (_U_(0x1) << MCAN_NDAT1_ND22_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND22                     MCAN_NDAT1_ND22_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND22_Msk instead */
#define MCAN_NDAT1_ND23_Pos                 23                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND23_Msk                 (_U_(0x1) << MCAN_NDAT1_ND23_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND23                     MCAN_NDAT1_ND23_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND23_Msk instead */
#define MCAN_NDAT1_ND24_Pos                 24                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND24_Msk                 (_U_(0x1) << MCAN_NDAT1_ND24_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND24                     MCAN_NDAT1_ND24_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND24_Msk instead */
#define MCAN_NDAT1_ND25_Pos                 25                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND25_Msk                 (_U_(0x1) << MCAN_NDAT1_ND25_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND25                     MCAN_NDAT1_ND25_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND25_Msk instead */
#define MCAN_NDAT1_ND26_Pos                 26                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND26_Msk                 (_U_(0x1) << MCAN_NDAT1_ND26_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND26                     MCAN_NDAT1_ND26_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND26_Msk instead */
#define MCAN_NDAT1_ND27_Pos                 27                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND27_Msk                 (_U_(0x1) << MCAN_NDAT1_ND27_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND27                     MCAN_NDAT1_ND27_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND27_Msk instead */
#define MCAN_NDAT1_ND28_Pos                 28                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND28_Msk                 (_U_(0x1) << MCAN_NDAT1_ND28_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND28                     MCAN_NDAT1_ND28_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND28_Msk instead */
#define MCAN_NDAT1_ND29_Pos                 29                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND29_Msk                 (_U_(0x1) << MCAN_NDAT1_ND29_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND29                     MCAN_NDAT1_ND29_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND29_Msk instead */
#define MCAN_NDAT1_ND30_Pos                 30                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND30_Msk                 (_U_(0x1) << MCAN_NDAT1_ND30_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND30                     MCAN_NDAT1_ND30_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND30_Msk instead */
#define MCAN_NDAT1_ND31_Pos                 31                                             /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND31_Msk                 (_U_(0x1) << MCAN_NDAT1_ND31_Pos)              /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND31                     MCAN_NDAT1_ND31_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT1_ND31_Msk instead */
#define MCAN_NDAT1_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (MCAN_NDAT1) Register MASK  (Use MCAN_NDAT1_Msk instead)  */
#define MCAN_NDAT1_Msk                      _U_(0xFFFFFFFF)                                /**< (MCAN_NDAT1) Register Mask  */

#define MCAN_NDAT1_ND_Pos                   0                                              /**< (MCAN_NDAT1 Position) New Data */
#define MCAN_NDAT1_ND_Msk                   (_U_(0xFFFFFFFF) << MCAN_NDAT1_ND_Pos)         /**< (MCAN_NDAT1 Mask) ND */
#define MCAN_NDAT1_ND(value)                (MCAN_NDAT1_ND_Msk & ((value) << MCAN_NDAT1_ND_Pos))  

/* -------- MCAN_NDAT2 : (MCAN Offset: 0x9c) (R/W 32) New Data 2 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t ND32:1;                    /**< bit:      0  New Data                                 */
    uint32_t ND33:1;                    /**< bit:      1  New Data                                 */
    uint32_t ND34:1;                    /**< bit:      2  New Data                                 */
    uint32_t ND35:1;                    /**< bit:      3  New Data                                 */
    uint32_t ND36:1;                    /**< bit:      4  New Data                                 */
    uint32_t ND37:1;                    /**< bit:      5  New Data                                 */
    uint32_t ND38:1;                    /**< bit:      6  New Data                                 */
    uint32_t ND39:1;                    /**< bit:      7  New Data                                 */
    uint32_t ND40:1;                    /**< bit:      8  New Data                                 */
    uint32_t ND41:1;                    /**< bit:      9  New Data                                 */
    uint32_t ND42:1;                    /**< bit:     10  New Data                                 */
    uint32_t ND43:1;                    /**< bit:     11  New Data                                 */
    uint32_t ND44:1;                    /**< bit:     12  New Data                                 */
    uint32_t ND45:1;                    /**< bit:     13  New Data                                 */
    uint32_t ND46:1;                    /**< bit:     14  New Data                                 */
    uint32_t ND47:1;                    /**< bit:     15  New Data                                 */
    uint32_t ND48:1;                    /**< bit:     16  New Data                                 */
    uint32_t ND49:1;                    /**< bit:     17  New Data                                 */
    uint32_t ND50:1;                    /**< bit:     18  New Data                                 */
    uint32_t ND51:1;                    /**< bit:     19  New Data                                 */
    uint32_t ND52:1;                    /**< bit:     20  New Data                                 */
    uint32_t ND53:1;                    /**< bit:     21  New Data                                 */
    uint32_t ND54:1;                    /**< bit:     22  New Data                                 */
    uint32_t ND55:1;                    /**< bit:     23  New Data                                 */
    uint32_t ND56:1;                    /**< bit:     24  New Data                                 */
    uint32_t ND57:1;                    /**< bit:     25  New Data                                 */
    uint32_t ND58:1;                    /**< bit:     26  New Data                                 */
    uint32_t ND59:1;                    /**< bit:     27  New Data                                 */
    uint32_t ND60:1;                    /**< bit:     28  New Data                                 */
    uint32_t ND61:1;                    /**< bit:     29  New Data                                 */
    uint32_t ND62:1;                    /**< bit:     30  New Data                                 */
    uint32_t ND63:1;                    /**< bit:     31  New Data                                 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t ND:32;                     /**< bit:  0..31  New Data                                 */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_NDAT2_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_NDAT2_OFFSET                   (0x9C)                                        /**<  (MCAN_NDAT2) New Data 2 Register  Offset */

