Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/mcan.h
/* -------- MCAN_TXBCF : (MCAN Offset: 0xdc) (R/ 32) Transmit Buffer Cancellation Finished Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CF0:1;                     /**< bit:      0  Cancellation Finished for Transmit Buffer 0 */
    uint32_t CF1:1;                     /**< bit:      1  Cancellation Finished for Transmit Buffer 1 */
    uint32_t CF2:1;                     /**< bit:      2  Cancellation Finished for Transmit Buffer 2 */
    uint32_t CF3:1;                     /**< bit:      3  Cancellation Finished for Transmit Buffer 3 */
    uint32_t CF4:1;                     /**< bit:      4  Cancellation Finished for Transmit Buffer 4 */
    uint32_t CF5:1;                     /**< bit:      5  Cancellation Finished for Transmit Buffer 5 */
    uint32_t CF6:1;                     /**< bit:      6  Cancellation Finished for Transmit Buffer 6 */
    uint32_t CF7:1;                     /**< bit:      7  Cancellation Finished for Transmit Buffer 7 */
    uint32_t CF8:1;                     /**< bit:      8  Cancellation Finished for Transmit Buffer 8 */
    uint32_t CF9:1;                     /**< bit:      9  Cancellation Finished for Transmit Buffer 9 */
    uint32_t CF10:1;                    /**< bit:     10  Cancellation Finished for Transmit Buffer 10 */
    uint32_t CF11:1;                    /**< bit:     11  Cancellation Finished for Transmit Buffer 11 */
    uint32_t CF12:1;                    /**< bit:     12  Cancellation Finished for Transmit Buffer 12 */
    uint32_t CF13:1;                    /**< bit:     13  Cancellation Finished for Transmit Buffer 13 */
    uint32_t CF14:1;                    /**< bit:     14  Cancellation Finished for Transmit Buffer 14 */
    uint32_t CF15:1;                    /**< bit:     15  Cancellation Finished for Transmit Buffer 15 */
    uint32_t CF16:1;                    /**< bit:     16  Cancellation Finished for Transmit Buffer 16 */
    uint32_t CF17:1;                    /**< bit:     17  Cancellation Finished for Transmit Buffer 17 */
    uint32_t CF18:1;                    /**< bit:     18  Cancellation Finished for Transmit Buffer 18 */
    uint32_t CF19:1;                    /**< bit:     19  Cancellation Finished for Transmit Buffer 19 */
    uint32_t CF20:1;                    /**< bit:     20  Cancellation Finished for Transmit Buffer 20 */
    uint32_t CF21:1;                    /**< bit:     21  Cancellation Finished for Transmit Buffer 21 */
    uint32_t CF22:1;                    /**< bit:     22  Cancellation Finished for Transmit Buffer 22 */
    uint32_t CF23:1;                    /**< bit:     23  Cancellation Finished for Transmit Buffer 23 */
    uint32_t CF24:1;                    /**< bit:     24  Cancellation Finished for Transmit Buffer 24 */
    uint32_t CF25:1;                    /**< bit:     25  Cancellation Finished for Transmit Buffer 25 */
    uint32_t CF26:1;                    /**< bit:     26  Cancellation Finished for Transmit Buffer 26 */
    uint32_t CF27:1;                    /**< bit:     27  Cancellation Finished for Transmit Buffer 27 */
    uint32_t CF28:1;                    /**< bit:     28  Cancellation Finished for Transmit Buffer 28 */
    uint32_t CF29:1;                    /**< bit:     29  Cancellation Finished for Transmit Buffer 29 */
    uint32_t CF30:1;                    /**< bit:     30  Cancellation Finished for Transmit Buffer 30 */
    uint32_t CF31:1;                    /**< bit:     31  Cancellation Finished for Transmit Buffer 31 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CF:32;                     /**< bit:  0..31  Cancellation Finished for Transmit Buffer 3x */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TXBCF_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXBCF_OFFSET                   (0xDC)                                        /**<  (MCAN_TXBCF) Transmit Buffer Cancellation Finished Register  Offset */

#define MCAN_TXBCF_CF0_Pos                  0                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 0 Position */
#define MCAN_TXBCF_CF0_Msk                  (_U_(0x1) << MCAN_TXBCF_CF0_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 0 Mask */
#define MCAN_TXBCF_CF0                      MCAN_TXBCF_CF0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF0_Msk instead */
#define MCAN_TXBCF_CF1_Pos                  1                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 1 Position */
#define MCAN_TXBCF_CF1_Msk                  (_U_(0x1) << MCAN_TXBCF_CF1_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 1 Mask */
#define MCAN_TXBCF_CF1                      MCAN_TXBCF_CF1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF1_Msk instead */
#define MCAN_TXBCF_CF2_Pos                  2                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 2 Position */
#define MCAN_TXBCF_CF2_Msk                  (_U_(0x1) << MCAN_TXBCF_CF2_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 2 Mask */
#define MCAN_TXBCF_CF2                      MCAN_TXBCF_CF2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF2_Msk instead */
#define MCAN_TXBCF_CF3_Pos                  3                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 3 Position */
#define MCAN_TXBCF_CF3_Msk                  (_U_(0x1) << MCAN_TXBCF_CF3_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 3 Mask */
#define MCAN_TXBCF_CF3                      MCAN_TXBCF_CF3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF3_Msk instead */
#define MCAN_TXBCF_CF4_Pos                  4                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 4 Position */
#define MCAN_TXBCF_CF4_Msk                  (_U_(0x1) << MCAN_TXBCF_CF4_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 4 Mask */
#define MCAN_TXBCF_CF4                      MCAN_TXBCF_CF4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF4_Msk instead */
#define MCAN_TXBCF_CF5_Pos                  5                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 5 Position */
#define MCAN_TXBCF_CF5_Msk                  (_U_(0x1) << MCAN_TXBCF_CF5_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 5 Mask */
#define MCAN_TXBCF_CF5                      MCAN_TXBCF_CF5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF5_Msk instead */
#define MCAN_TXBCF_CF6_Pos                  6                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 6 Position */
#define MCAN_TXBCF_CF6_Msk                  (_U_(0x1) << MCAN_TXBCF_CF6_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 6 Mask */
#define MCAN_TXBCF_CF6                      MCAN_TXBCF_CF6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF6_Msk instead */
#define MCAN_TXBCF_CF7_Pos                  7                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 7 Position */
#define MCAN_TXBCF_CF7_Msk                  (_U_(0x1) << MCAN_TXBCF_CF7_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 7 Mask */
#define MCAN_TXBCF_CF7                      MCAN_TXBCF_CF7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF7_Msk instead */
#define MCAN_TXBCF_CF8_Pos                  8                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 8 Position */
#define MCAN_TXBCF_CF8_Msk                  (_U_(0x1) << MCAN_TXBCF_CF8_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 8 Mask */
#define MCAN_TXBCF_CF8                      MCAN_TXBCF_CF8_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF8_Msk instead */
#define MCAN_TXBCF_CF9_Pos                  9                                              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 9 Position */
#define MCAN_TXBCF_CF9_Msk                  (_U_(0x1) << MCAN_TXBCF_CF9_Pos)               /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 9 Mask */
#define MCAN_TXBCF_CF9                      MCAN_TXBCF_CF9_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF9_Msk instead */
#define MCAN_TXBCF_CF10_Pos                 10                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 10 Position */
#define MCAN_TXBCF_CF10_Msk                 (_U_(0x1) << MCAN_TXBCF_CF10_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 10 Mask */
#define MCAN_TXBCF_CF10                     MCAN_TXBCF_CF10_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF10_Msk instead */
#define MCAN_TXBCF_CF11_Pos                 11                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 11 Position */
#define MCAN_TXBCF_CF11_Msk                 (_U_(0x1) << MCAN_TXBCF_CF11_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 11 Mask */
#define MCAN_TXBCF_CF11                     MCAN_TXBCF_CF11_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF11_Msk instead */
#define MCAN_TXBCF_CF12_Pos                 12                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 12 Position */
#define MCAN_TXBCF_CF12_Msk                 (_U_(0x1) << MCAN_TXBCF_CF12_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 12 Mask */
#define MCAN_TXBCF_CF12                     MCAN_TXBCF_CF12_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF12_Msk instead */
#define MCAN_TXBCF_CF13_Pos                 13                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 13 Position */
#define MCAN_TXBCF_CF13_Msk                 (_U_(0x1) << MCAN_TXBCF_CF13_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 13 Mask */
#define MCAN_TXBCF_CF13                     MCAN_TXBCF_CF13_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF13_Msk instead */
#define MCAN_TXBCF_CF14_Pos                 14                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 14 Position */
#define MCAN_TXBCF_CF14_Msk                 (_U_(0x1) << MCAN_TXBCF_CF14_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 14 Mask */
#define MCAN_TXBCF_CF14                     MCAN_TXBCF_CF14_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF14_Msk instead */
#define MCAN_TXBCF_CF15_Pos                 15                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 15 Position */
#define MCAN_TXBCF_CF15_Msk                 (_U_(0x1) << MCAN_TXBCF_CF15_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 15 Mask */
#define MCAN_TXBCF_CF15                     MCAN_TXBCF_CF15_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF15_Msk instead */
#define MCAN_TXBCF_CF16_Pos                 16                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 16 Position */
#define MCAN_TXBCF_CF16_Msk                 (_U_(0x1) << MCAN_TXBCF_CF16_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 16 Mask */
#define MCAN_TXBCF_CF16                     MCAN_TXBCF_CF16_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF16_Msk instead */
#define MCAN_TXBCF_CF17_Pos                 17                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 17 Position */
#define MCAN_TXBCF_CF17_Msk                 (_U_(0x1) << MCAN_TXBCF_CF17_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 17 Mask */
#define MCAN_TXBCF_CF17                     MCAN_TXBCF_CF17_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF17_Msk instead */
#define MCAN_TXBCF_CF18_Pos                 18                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 18 Position */
#define MCAN_TXBCF_CF18_Msk                 (_U_(0x1) << MCAN_TXBCF_CF18_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 18 Mask */
#define MCAN_TXBCF_CF18                     MCAN_TXBCF_CF18_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF18_Msk instead */
#define MCAN_TXBCF_CF19_Pos                 19                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 19 Position */
#define MCAN_TXBCF_CF19_Msk                 (_U_(0x1) << MCAN_TXBCF_CF19_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 19 Mask */
#define MCAN_TXBCF_CF19                     MCAN_TXBCF_CF19_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF19_Msk instead */
#define MCAN_TXBCF_CF20_Pos                 20                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 20 Position */
#define MCAN_TXBCF_CF20_Msk                 (_U_(0x1) << MCAN_TXBCF_CF20_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 20 Mask */
#define MCAN_TXBCF_CF20                     MCAN_TXBCF_CF20_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF20_Msk instead */
#define MCAN_TXBCF_CF21_Pos                 21                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 21 Position */
#define MCAN_TXBCF_CF21_Msk                 (_U_(0x1) << MCAN_TXBCF_CF21_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 21 Mask */
#define MCAN_TXBCF_CF21                     MCAN_TXBCF_CF21_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF21_Msk instead */
#define MCAN_TXBCF_CF22_Pos                 22                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 22 Position */
#define MCAN_TXBCF_CF22_Msk                 (_U_(0x1) << MCAN_TXBCF_CF22_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 22 Mask */
#define MCAN_TXBCF_CF22                     MCAN_TXBCF_CF22_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF22_Msk instead */
#define MCAN_TXBCF_CF23_Pos                 23                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 23 Position */
#define MCAN_TXBCF_CF23_Msk                 (_U_(0x1) << MCAN_TXBCF_CF23_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 23 Mask */
#define MCAN_TXBCF_CF23                     MCAN_TXBCF_CF23_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF23_Msk instead */
#define MCAN_TXBCF_CF24_Pos                 24                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 24 Position */
#define MCAN_TXBCF_CF24_Msk                 (_U_(0x1) << MCAN_TXBCF_CF24_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 24 Mask */
#define MCAN_TXBCF_CF24                     MCAN_TXBCF_CF24_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF24_Msk instead */
#define MCAN_TXBCF_CF25_Pos                 25                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 25 Position */
#define MCAN_TXBCF_CF25_Msk                 (_U_(0x1) << MCAN_TXBCF_CF25_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 25 Mask */
#define MCAN_TXBCF_CF25                     MCAN_TXBCF_CF25_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF25_Msk instead */
#define MCAN_TXBCF_CF26_Pos                 26                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 26 Position */
#define MCAN_TXBCF_CF26_Msk                 (_U_(0x1) << MCAN_TXBCF_CF26_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 26 Mask */
#define MCAN_TXBCF_CF26                     MCAN_TXBCF_CF26_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF26_Msk instead */
#define MCAN_TXBCF_CF27_Pos                 27                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 27 Position */
#define MCAN_TXBCF_CF27_Msk                 (_U_(0x1) << MCAN_TXBCF_CF27_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 27 Mask */
#define MCAN_TXBCF_CF27                     MCAN_TXBCF_CF27_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF27_Msk instead */
#define MCAN_TXBCF_CF28_Pos                 28                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 28 Position */
#define MCAN_TXBCF_CF28_Msk                 (_U_(0x1) << MCAN_TXBCF_CF28_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 28 Mask */
#define MCAN_TXBCF_CF28                     MCAN_TXBCF_CF28_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF28_Msk instead */
#define MCAN_TXBCF_CF29_Pos                 29                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 29 Position */
#define MCAN_TXBCF_CF29_Msk                 (_U_(0x1) << MCAN_TXBCF_CF29_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 29 Mask */
#define MCAN_TXBCF_CF29                     MCAN_TXBCF_CF29_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF29_Msk instead */
#define MCAN_TXBCF_CF30_Pos                 30                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 30 Position */
#define MCAN_TXBCF_CF30_Msk                 (_U_(0x1) << MCAN_TXBCF_CF30_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 30 Mask */
#define MCAN_TXBCF_CF30                     MCAN_TXBCF_CF30_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF30_Msk instead */
#define MCAN_TXBCF_CF31_Pos                 31                                             /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 31 Position */
#define MCAN_TXBCF_CF31_Msk                 (_U_(0x1) << MCAN_TXBCF_CF31_Pos)              /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 31 Mask */
#define MCAN_TXBCF_CF31                     MCAN_TXBCF_CF31_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCF_CF31_Msk instead */
#define MCAN_TXBCF_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (MCAN_TXBCF) Register MASK  (Use MCAN_TXBCF_Msk instead)  */
#define MCAN_TXBCF_Msk                      _U_(0xFFFFFFFF)                                /**< (MCAN_TXBCF) Register Mask  */

#define MCAN_TXBCF_CF_Pos                   0                                              /**< (MCAN_TXBCF Position) Cancellation Finished for Transmit Buffer 3x */
#define MCAN_TXBCF_CF_Msk                   (_U_(0xFFFFFFFF) << MCAN_TXBCF_CF_Pos)         /**< (MCAN_TXBCF Mask) CF */
#define MCAN_TXBCF_CF(value)                (MCAN_TXBCF_CF_Msk & ((value) << MCAN_TXBCF_CF_Pos))  

